{
    "htop": {
        "cpu_usage": "Общее использование ЦП: ",
        "network": "Сеть [MiB/s] [Вверх/Вниз]",
        "ram": "Память [%]",
        "ram_usage": "Использование физической памяти",
        "swap_usage": "Использование виртуальной памяти",
        "title": "Главная"
    },
    "fswitch": {
        "title": "Функции",
        "function_switch": {
            "title": "Переключатели функций",
            "clever": "Режим умной оптимизации",
            "a1Memory": "Управление памятью A1",
            "CutMemoryFreed": "Освобождение памяти",
            "appSleep": "Сон приложений",
            "crazyKill": "Убийство процессов",
            "injection": "Инъекция в активность",
            "memThreshold": "Порог памяти"
        },
        "numerical_parameter": {
            "title": "Числовые параметры",
            "memThreshold_value": "Порог: ",
            "memThreshold_slider": "Ползунок порога"
        }
    },
    "other": {
        "save": "[Сохранить]",
        "quit": "[Выход]",
        "teffect": "[Применить сейчас]",
        "join": "[Присоединиться к TG-каналу]",
        "github": "[GitHub проект]"
    },
    "feature_Description": {
        "clever": {
            "Description_title": "Умный режим",
            "Description": "Завершает процессы, добавленные пользователем, чтобы освободить память. Завершает только в фоновом режиме."
        },
        "a1Memory": {
            "Description_title": "Управление памятью A1",
            "Description": "Автоматическое управление памятью. Освобождает часть памяти процесса или завершает процессы при необходимости."
        },
        "CutMemoryFreed": {
            "Description_title": "Освобождение памяти",
            "Description": "По умолчанию уменьшает использование памяти кэш-процессами. Не беспокойтесь, это только для экономии памяти, не завершая эти процессы."
        },
        "appSleep": {
            "Description_title": "Сон приложения",
            "Description": "Эта функция предотвращает перезапуск дочерних процессов приложения после их завершения. Хотя она не может гарантировать предотвращение перезапуска, она также помогает уменьшить использование памяти и CPU."
        },
        "crazyKill": {
            "Description_title": "Безумное завершение",
            "Description": "Вызывает ядерный интерфейс для освобождения памяти, хотя конкретные критерии еще не совсем ясны. Однако, на основе текущей проверки, он действительно может сделать работу телефона более плавной. Но стоит помнить, что это может привести к завершению некоторых фоновых приложений."
        },
        "injection": {
            "Description_title": "Блокировка lmkd",
            "Description": "Hook-инъекция в lmkd, изменяя его логику выполнения, предотвращая завершение фоновых приложений. Это означает, что вы можете запустить множество процессов приложений, не боясь, что их убьют. Однако следует помнить, что запуск слишком многих процессов может замедлить работу телефона."
        },
        "memThreshold": {
            "Description_title": "Порог памяти",
            "Description": "При включении этой функции, когда физическая память достигает определенного уровня использования, lmkd может завершить процессы приложения, предотвращая торможение или перезагрузку устройства. Стоит помнить, что это будет работать только при блокировке lmkd."
        }
    },    
    "tag": {
        "content": "Пожалуйста, закройте интерфейс управления памятью, чтобы избежать ненужного потребления заряда батареи. После сохранения конфигурации в интерфейсе обязательно выйдите из него.",
        "title": "Пожалуйста, сохраните конфигурацию и перезагрузите телефон. Процесс: UI_memory"
    }
}